In [ ]:
import pandas as pd

In [ ]:
saram = pd.DataFrame({'이름':['김갑수','박유진','김홍수','손흥남'],
                      '키':[172,145,166,182],
                      '나이':[54,31,19,34]
                     })

In [ ]:
saram

In [ ]:
sum(saram['나이'])/len(saram['나이'])

In [ ]:
saram['나이'].mean()

In [ ]:
saram.to_csv('saram.csv')

In [ ]:
cccc=pd.read_csv('cccc.csv')

In [ ]:
cccc2 = cccc.copy()

In [ ]:
cccc2 = cccc.rename(columns = {'살인':'살해'})

In [49]:
saram['키(M)'] = saram['키']/100

In [53]:
import numpy as np

In [54]:
saram

    이름    키  나이  키(M)
0  김갑수  172  54  1.72
1  박유진  145  31  1.45
2  김홍수  166  19  1.66
3  손흥남  182  34  1.82

In [58]:
saram['키높낮이'] = np.where(saram['키']> 170,'큼','작음')

In [59]:
saram

    이름    키  나이  키(M) 키높낮이
0  김갑수  172  54  1.72    큼
1  박유진  145  31  1.45   작음
2  김홍수  166  19  1.66   작음
3  손흥남  182  34  1.82    큼

In [75]:
newsaram = saram.query('키 >= 172 & 나이 < 40')

In [79]:
saram.drop(columns = '키(M)')

    이름    키  나이 키높낮이
0  김갑수  172  54    큼
1  박유진  145  31   작음
2  김홍수  166  19   작음
3  손흥남  182  34    큼

In [82]:
newsaram = saram.query('키 >= 172 & 나이 < 40')\
[['이름','키','나이']]\
.head()

In [83]:
newsaram

    이름    키  나이
3  손흥남  182  34

In [84]:
saram

    이름    키  나이  키(M) 키높낮이
0  김갑수  172  54  1.72    큼
1  박유진  145  31  1.45   작음
2  김홍수  166  19  1.66   작음
3  손흥남  182  34  1.82    큼

In [89]:
saram3 = saram.sort_values('나이', ascending = False)

In [90]:
saram3

    이름    키  나이  키(M) 키높낮이
0  김갑수  172  54  1.72    큼
3  손흥남  182  34  1.82    큼
1  박유진  145  31  1.45   작음
2  김홍수  166  19  1.66   작음

In [92]:
saram3.assign(나이대=saram3['나이']/10)

    이름    키  나이  키(M) 키높낮이  나이대
0  김갑수  172  54  1.72    큼  5.4
3  손흥남  182  34  1.82    큼  3.4
1  박유진  145  31  1.45   작음  3.1
2  김홍수  166  19  1.66   작음  1.9

In [94]:
saramki = saram3.agg(키_정보=('키','mean'))

In [95]:
saramki

           키
키_정보  166.25

In [98]:
saram.groupby('키높낮이').agg(키_정보=('키','mean'))

       키_정보
키높낮이
작음    155.5
큼     177.0

In [99]:
saram

    이름    키  나이  키(M) 키높낮이
0  김갑수  172  54  1.72    큼
1  박유진  145  31  1.45   작음
2  김홍수  166  19  1.66   작음
3  손흥남  182  34  1.82    큼

In [111]:
saramx = pd.DataFrame({'이름':['나동조','김유신','박남정'],
                      '키':[142,195,176],
                      '나이':[34,30,29]
                     })

In [117]:
saramx

    이름    키  나이
0  나동조  142  34
1  김유신  195  30
2  박남정  176  29

In [119]:
saramxx = pd.DataFrame({'이름':['나동조','박남정','김유신'],
                      '몸무게':[42,76,95]
                     })

In [120]:
saramxx

    이름  몸무게
0  나동조   42
1  박남정   76
2  김유신   95

In [121]:
pd.concat([saramx,saramxx],axis=1)

    이름    키  나이   이름  몸무게
0  나동조  142  34  나동조   42
1  김유신  195  30  박남정   76
2  박남정  176  29  김유신   95

In [123]:
#이거는 합치는 명령어야
pd.merge(saramx,saramxx,how='left',on='이름')

    이름    키  나이  몸무게
0  나동조  142  34   42
1  김유신  195  30   95
2  박남정  176  29   76